Revit 2024 API
ParameterTypeId.FbxLightLumenaireDirt Property
 "Luminaire Dirt Depreciation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FbxLightLumenaireDirt { get; }
Visual Basic
Public Shared ReadOnly Property FbxLightLumenaireDirt As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FbxLightLumenaireDirt {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace